{
  "basics": {
    "name": "Patrik Martinsson",
    "label": "Linux System Administrator",
    "picture": "https://www.redlin.se/images/contact/patrik.png",
    "email": "patrik@redlin.se",
    "phone": "(+46) 707 27 64 96",
    "website": "www.redlin.se",
    "website_img": "https://www.redlin.se/images/logo-no-text-no-borders.svg",
    "summary": "My name is Patrik Martinsson and I'm a Linux System Administrator from Norrköping, Sweden. I'm a Linux-enthusiast, active in the community with various bug reports, patches, discussions, etc. I'm always eager to learn new things and can adapt very quickly to various kinds of situations. I’m running my own company called <a href='https://www.redlin.se'>RedLin</a>, specializing on Red Hat products.",
    "languages": "Swedish | English",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Norrköping | Remote",
      "countryCode": "",
      "region": "Sweden"
    },
    "profiles": [
      {
        "network": "linkedin",
        "username": "linkedin",
        "url": "https://www.linkedin.com/in/patrikmartinsson/"
      },
      {
        "network": "gitHub",
        "username": "github",
        "url": "https://github.com/patchon"
      },
      {
        "network": "stack-overflow",
        "username": "stackoverflow",
        "url": "https://stackoverflow.com/users/2253454/patrik-martinsson"
      },
      {
        "network": "redhat",
        "username": "Red Hat Certified Engineer | Ceph",
        "url": "https://rhtapps.redhat.com/verify/?certId=170-249-643"
      }
    ]
  },
  "skills": [
    {
      "name": "Linux",
      "level": "Master",
      "keywords": [
        "containers",
        "red hat",
        "bash",
        "docker",
        "podman",
        "grafana",
        "prometheus",
        "nginx",
        "apache",
        "kerberos",
        "rpm",
        "systemd"
      ]
    },
    {
      "name": "DevOps CI / CD",
      "level": "Advanced",
      "keywords": [
        "argocd",
        "tekton",
        "helm",
        "gitlab ci",
        "bitbucket",
        "pipelines",
        "jenkins",
        "maven",
        "nexus",
        "artifactory",
        "github actions"
      ]
    },
    {
      "name": "Cloud",
      "level": "Master",
      "keywords": [
        "openshift",
        "kubernetes",
        "vault",
        "openstack",
        "ceph",
        "terraform",
        "aws",
        "kong",
        "keycloak",
        "object storage s3 / swift"
      ]
    },
    {
      "name": "Automation",
      "level": "Master",
      "keywords": [
        "ansible",
        "puppet",
        "foreman",
        "ansible tower",
        "anaconda",
        "kickstart",
        "pxe"
      ]
    },
    {
      "name": "API / Integration",
      "level": "Master",
      "keywords": [
        "vmware vsphere",
        "openshift",
        "jira",
        "servicenow",
        "infoblox",
        "cisco ucs",
        "op5 monitor",
        "ldap",
        "checkmk",
        "active directory",
        "single sign on"
      ]
    },
    {
      "name": "Programming",
      "level": "Advanced",
      "keywords": [
        "perl",
        "python",
        "php",
        "go",
        "c / c++",
        "javascript",
        "regular expressions"
      ]
    }
  ],
  "topic_count": false,
  "assignments": [
    {
      "company": "Karolinska University Hospital",
      "position": "OpenShift Specialist / DevOps Engineer",
      "website": "https://www.karolinska.se",
      "startDate": "2022-11-01",
      "endDate": "",
      "keywords": [
        "consulting",
        "openshift",
        "terraform",
        "helm",
        "argocd",
        "vault",
        "kong",
        "github actions",
        "keycloak",
        "openshift",
        "vmware"
      ],
      "summary": "",
      "summary_continue": "At the Karolinska University Hospital I'm a part of their DevOps team helping them to build their new internal cloud solution based on OpenShift. This work consists both of building the actual infrastructure it self, but also setting up and configuring all the components that will be in the platform. I've been a key player in designing and installing this new infrastructure, which includes both networking and storage. I've also helped with improving and securing their current OpenShift clusters, as well as upgrading them and making them more stable. \n\n I'm currently working with the team helping them installing and configuring components such as, Vault, Kong, ArgoCD, GitHub Actions, cert-manager, external-secrets, Confluent, PostgreSQL among others. Everything we do is infrastructure as code to secure version control and ease the deployments.\n\n On top of that I've also worked quite a lot with their VMware enviroment, HPE Synergy Frames, as well as Citrix ADC, automating various tasks with tools such as Terraform."
    },
    {
      "company": "Bonnier News",
      "position": "Cloud Engineer",
      "website": "https://www.bonniernews.se",
      "startDate": "2022-01-10",
      "endDate": "2022-10-25",
      "keywords": [
        "consulting",
        "aws",
        "gcp",
        "cloudrun",
        "kafka",
        "terraform",
        "openshift"
      ],
      "summary": "",
      "summary_continue": "My assignment at Bonnier News mostly consisted of helping developer teams migrating their current workload from OpenShift to Google Cloud. This included techniques, such as Kafka, Cassandra, PostgreSQL, MongoDB, various NodeJS applications. Everything was done via Terraform and built as infrastructure as code, this includes networking, loadbalancing, routes, certificates, workload resources (such as a DB for example) and other underlying resources (containers, storage, virtual machines, etc.).\n\n On top of that my team and I was also responsible for maintaining and lifecycling their current OpenShift environments."
    }
  ],
  "work": [
    {
      "company": "RedLin PM AB",
      "position": "Linux System Administrator and Founder",
      "website": "https://www.redlin.se",
      "startDate": "2022-01-10",
      "endDate": "",
      "keywords": [
        "consulting",
        "red hat",
        "linux system administrator",
        "automation",
        "standardize",
        "development"
      ],
      "summary": "RedLin is created and owned by Patrik Martinsson who has been in love with Red Hat for over a decade. We help our customers to automate, standardize and develop their infrastructure with the help of Linux and Red Hat products. At RedLin we can take on roles such as,",
      "highlights": [
        {
          "indentclass": "",
          "detail": "Site Reliability Engineer"
        },
        {
          "indentclass": "",
          "detail": "Linux System Adminstrator"
        },
        {
          "indentclass": "",
          "detail": "DevOps Engineer"
        }
      ],
      "summary_continue": "At RedLin we are used to tools such as Ansible and Puppet for automation and consistency. We also recognize the importance of having continuous deployment pipelines in place, not only for things like products and container images, but also for other parts of the infrastructure. Together with you, we want to build an fully automated, daily patched, high availability infrastructure.\n\nWe simply provide expertise and tailored solutions primarily built on Linux and Red Hat products."
    },
    {
      "company": "The Swedish Employment Office",
      "position": "OpenShift Specialist / DevOps Engineer",
      "website": "https://www.arbetsformedlingen.se",
      "startDate": "2020-08-01",
      "endDate": "2021-12-19",
      "keywords": [
        "openshift",
        "kubernetes",
        "cloud",
        "argocd",
        "containers",
        "devops",
        "infrastructure as code"
      ],
      "summary": "My main responsibilites at The Swedish Employment Office has been to design, configure and install their new cloud container platform which is based on OpenShift 4.6. Ceph is used as the underlying storage and the Cisco ACI-CNI plugin for the network integration. I've put a lot of effort into self service and integrations to other parts of their infrastructure, such as Oauth2 authentication and project management through Servicenow. The cluster is installed on Cisco UCS hardware and spread over multiple datacenters for high availability. ",
      "summary_continue": "I've also spend quite some time with development teams, helping them containerizing their applications. These applications has mostly been written in Java (Spring Boot / JBoss EAP), Angular, Python, NodeJS, etc. On top of that I've also been working with development teams helping them creating pipelines in Jenkins (Groovy) and automating their process for releasing new code.  \n In addition to that, I've also setup quite a few applications to demonstrate the power of a container platform, this includes applications such as PostgreSQL, MongoDB, Jira, Mattermost, Rocketchat, Element Matrix, Pastebins, etc."
    },
    {
      "company": "TriOptima",
      "position": "Linux System Administrator",
      "website": "https://www.trioptima.com",
      "startDate": "2016-04-01",
      "endDate": "2019-11-22",
      "keywords": [
        "openstack",
        "ceph",
        "red hat director",
        "ansible",
        "cloud",
        "terraform",
        "kerberos"
      ],
      "summary": "My main responsibilites at TriOptima has been the installation, configuration and design of their Openstack and Ceph platform. The setup spans over three data centers and is based on Red Hat Openstack Platform 13 and Red Hat Ceph Storage 3. The design includes everything from different availability zones, storage pools (both local and stretched between multiple data centers), and involves roughly 50 nodes. The deployment of OpenStack is done through the Red Hat Director, while Ceph is being deployed using the Ceph Ansible Playbook. We have chosen this configuration to get an environment that scales and fulfills our internal customers requirements. \n During the implementation I’ve encountered quite a few bugs in various components (neutron, octavia, heat-templates, networkmanager) which have actively been reported upstream (also monkey patched a few things locally to work around numerous deployment issues).\n On top of that I’ve also built our own internal portal where the users can create, delete and manage access to their projects. Authentication to the portal, and to the cloud, is done via Kerberos (Active Directory) and supports Single Sign On. "
    },
    {
      "company": "SMHI",
      "position": "Linux System Administrator",
      "website": "https://www.smhi.se",
      "startDate": "2008-05-16",
      "endDate": "2016-01-22",
      "keywords": [
        "puppet",
        "foreman",
        "cisco ucs",
        "itrs op5 monitor",
        "automation",
        "vmware",
        "infoblox",
        "nfs"
      ],
      "summary": "My 'day-to-day'-tasks consisted of managing ~ 1000 Red Hat Enterprise Servers and ~ 150 Red Hat Enterprise Clients. Usually it involves making sure everything is up running and that the setups are consistent. This is essentially done by Puppet, Ansible and various automation-scripts (preferable in bash, perl or python). I've done a lot of scripting to various parts of our infrastructure, this includes Cisco UCS, VMware, Infoblox, HP iLO, Foreman, Puppet, ITRS OP5 Monitor, Cacti, Various CA technologies products, etc. As previously mentioned, my job often consisted of setting up, configuring, re-configuring, purging servers, so scripting is quite essential. \n\nI've been a key-player in SMHI's attempt to standardize their Linux Platforms (both for Servers and Clients). The goal was to make sure that every Linux Server and Client would be centrally managed and properly configured to SMHI's infrastructure and policies, that includes,",
      "highlights": [
        {
          "indentclass": "",
          "detail": "Authentication (Active Directory, Kerberos, Smart Card, PKCS11, Cisco Anyconnect)"
        },
        {
          "indentclass": "",
          "detail": "File shares (NFSv3, NFSv4 + Kerberos, automount)"
        },
        {
          "indentclass": "",
          "detail": "Wireless 802.1x (Certificate enrolment through SCEP)"
        },
        {
          "indentclass": "",
          "detail": "Fully automated installations and configurations for both Servers and Clients (available for customers through self-service-portals)"
        }
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "SIDA",
      "position": "Linux System Administrator",
      "startDate": "2013-10-13",
      "endDate": "2013-11-01",
      "summary": "On behalf of the SIDA-organisation I've been visiting the “Department of Meteorological Services” in Botswana two times. My workthere has mostly consisted of deploying Linux Servers and setting up a “Request Tracker” - system and a wiki. The Biggest challenges with these missions has been the lack of infrastructure, internet access and the fact that everything has to be done while being there, no remote work has been possible.",
      "keywords": [
        "request tracker",
        "mediawiki",
        "virtualization"
      ]
    }
  ],
  "education": [
    {
      "institution": "Umeå University, Linné University",
      "area": "Separate Courses",
      "startDate": "2009-01-01",
      "endDate": "2010-01-01",
      "courses": [
        {
          "name": "Linux as a developing platform",
          "keywords": [
            "c",
            "gcc",
            "make",
            "shell"
          ]
        },
        {
          "name": "Structured Programming with C++",
          "keywords": [
            "object oriented c++",
            "classes",
            "boost"
          ]
        }
      ]
    },
    {
      "institution": "Jensen Education",
      "area": "Linux System administration",
      "startDate": "2007-01-01",
      "endDate": "2009-01-01",
      "courses": [
        {
          "name": "Network and computer communicationn",
          "keywords": [
            "inetd",
            "xinetd",
            "postfix",
            "bind",
            "apache",
            "nfs",
            "ldap"
          ]
        },
        {
          "name": "The Operating System Linux",
          "keywords": [
            "gnu tools",
            "file system",
            "file permissions",
            "pipes",
            "regular expressions"
          ]
        },
        {
          "name": "Programming in Linux",
          "keywords": [
            "Compiling",
            "shell scripting",
            "perl",
            "python",
            "bash",
            "monitoring"
          ]
        },
        {
          "name": "System Administration Linux",
          "keywords": [
            "user management",
            "logging",
            "backup",
            "kernel modules",
            "virtualization",
            "storage solution"
          ]
        }
      ]
    }
  ]
}
