{
  "basics": {
    "name": "Patrik Martinsson",
    "label": "Linux System Administratör",
    "picture": "https://www.redlin.se/images/contact/patrik.png",
    "email": "patrik@redlin.se",
    "phone": "(+46) 707 27 64 96",
    "website": "www.redlin.se",
    "website_img": "https://www.redlin.se/images/logo-no-text-no-borders.svg",
    "summary": "Jag heter Patrik Martinsson och arbetar som Linux Systemadministratör. Jag är en Linux entusiast som är aktiv i olika open source-projekt, mestadels via olika buggrapporter, patchar, diskussioner etc. Jag strävar alltid efter att lära mig nya saker och anpassar mig snabbt till olika situationer. Jag driver även mitt egna företag <a href='https://www.redlin.se'>RedLin</a>, där vi specialiserar oss på Red Hat produkter.",
    "languages": "Svenska | Engelska",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Norrköping | Distans",
      "countryCode": "",
      "region": "Sverige"
    },
    "profiles": [
      {
        "network": "linkedin",
        "username": "linkedin",
        "url": "https://www.linkedin.com/in/patrikmartinsson/"
      },
      {
        "network": "gitHub",
        "username": "github",
        "url": "https://github.com/patchon"
      },
      {
        "network": "stack-overflow",
        "username": "stackoverflow",
        "url": "https://stackoverflow.com/users/2253454/patrik-martinsson"
      },
      {
        "network": "redhat",
        "username": "Red Hat Certified Engineer | Ceph",
        "url": "https://rhtapps.redhat.com/verify/?certId=170-249-643"
      }
    ]
  },
  "skills": [
    {
      "name": "Linux",
      "level": "Mästare",
      "keywords": [
        "containers",
        "red hat",
        "bash",
        "docker",
        "podman",
        "grafana",
        "prometheus",
        "nginx",
        "apache",
        "kerberos",
        "rpm",
        "systemd"
      ]
    },
    {
      "name": "DevOps CI / CD",
      "level": "Avancerad",
      "keywords": [
        "argocd",
        "tekton",
        "helm",
        "gitlab ci",
        "bitbucket",
        "pipelines",
        "jenkins",
        "maven",
        "nexus",
        "artifactory",
        "github actions"
      ]
    },
    {
      "name": "Cloud",
      "level": "Mästare",
      "keywords": [
        "openshift",
        "kubernetes",
        "openstack",
        "ceph",
        "terraform",
        "aws",
        "kong",
        "keycloak",
        "objectstorage s3 / swift"
      ]
    },
    {
      "name": "Automation",
      "level": "Mästare",
      "keywords": [
        "ansible",
        "puppet",
        "foreman",
        "ansible tower",
        "anaconda",
        "kickstart",
        "pxe"
      ]
    },
    {
      "name": "API / Integration",
      "level": "Mästare",
      "keywords": [
        "vmware vsphere",
        "openshift",
        "jira",
        "servicenow",
        "infoblox",
        "cisco ucs",
        "op5 monitor",
        "ldap",
        "checkmk",
        "active directory",
        "single sign on"
      ]
    },
    {
      "name": "Programmering",
      "level": "Avancerad",
      "keywords": [
        "perl",
        "python",
        "php",
        "go",
        "c / c++",
        "javascript",
        "regular expressions"
      ]
    }
  ],
  "topic_count": false,
  "assignments": [
    {
      "company": "Karolinska Universitetssjukhuset",
      "position": "OpenShift Specialist / DevOps Engineer",
      "website": "https://www.karolinska.se",
      "startDate": "2022-11-01",
      "endDate": "",
      "keywords": [
        "konsult",
        "openshift",
        "terraform",
        "helm",
        "argocd",
        "vault",
        "kong",
        "github actions",
        "keycloak",
        "openshift",
        "vmware"
      ],
      "summary": "",
      "summary_continue": "På Karolinska universitetssjukhuset är jag en del av DevOps-teamet och hjälper dem att bygga deras nya interna molnlösning baserad på OpenShift. Arbetet innefattar både att bygga själva infrastrukturen, men också att konfigurera och installera alla komponenter som tillsammans bygger upp plattformen. Jag har varit en nyckelspelare i design, installation och implementation av den nya infrastrukturen, detta inkluderar både nätverk och lagring. Jag har även hjälpt till med att förbättra och säkra upp deras befintliga OpenShift-kluster, samt hjälpt till med uppgradering och gjort dem mer stabila. \n\nFör närvarande arbetar jag tillsammans med teamet och hjälper dem att installera och konfigurera komponenter så som Vault, Kong, ArgoCD, GitHub Actions, cert-manager, external-secrets, Confluent, PostgreSQL med flera. Allt vi gör är infrastrucutre-as-code för att säkerställa versionskontroll samt underlätta installations- samt uppgradings-förfaranden. \n\nUöver det har jag även arbetat en hel del med deras VMware-miljö, HPE Synergy Frames och Citrix ADC, där jag automatiserat olika uppgifter med verktyg så som Terraform."
    },
    {
      "company": "Bonnier News",
      "position": "Cloud Engineer",
      "website": "https://www.bonniernews.se",
      "startDate": "2022-01-10",
      "endDate": "2022-10-25",
      "keywords": [
        "konsult",
        "aws",
        "gcp",
        "cloudrun",
        "kafka",
        "terraform",
        "openshift"
      ],
      "summary": "",
      "summary_continue": "Mitt uppdrag på Bonnier News bestod till stor del av att hjälpa olika utvecklarteam med att migrera deras befintliga applikationer från OpenShift till Google Cloud. Detta inkluderade tekniker så som Kafka, Cassandra, PostgreSQL, MongoDB och olika NodeJS-applikationer. Allt gjordes med hjälp av Terraform och infrastructure-as-code. Detta inkluderar nätverk, lastbalansering, route's, certifikat och andra underliggande resurser (så som containrar, lagring, virtuella maskiner osv.). \n\nMitt team och jag var utöver det ansvariga för att underhålla och livscykelhantera de befintliga OpenShift-miljöerna."    }
  ],
  "work": [
    {
      "company": "RedLin PM AB",
      "position": "Linux Systemadministratör och Grundare",
      "website": "https://www.redlin.se",
      "startDate": "2022-01-10",
      "endDate": "",
      "keywords": [
        "red hat",
        "konsult",
        "linux systemadministratör",
        "automation",
        "standardisering",
        "utveckling"
      ],
      "summary": "Företaget RedLin är skapat och ägs av Patrik Martinsson som haft en förkärlek till Red Hat i över tio år. Vi hjälper våra kunder med att bygga, automatisera samt standardisera infrastruktur, detta med hjälp av Linux och Red Hat produkter. På RedLin kan vi ta oss an roller, så som,",
      "highlights": [
        {
          "indentclass": "",
          "detail": "Site Reliability Engineer"
        },
        {
          "indentclass": "",
          "detail": "Linux Systemadminstratör"
        },
        {
          "indentclass": "",
          "detail": "DevOps Engineer"
        }
      ],
      "summary_continue": "På RedLin använder vi verktyg så som Ansible och Puppet för automation och garantera konsistens. Vi arbetar också med 'continous deployment' och 'pipelines', inte bara för produkter och containers, utan även för hela infrastrukturen. Målet är att tillsammans med kunden bygga en helautomatiserad infrastruktur som kontinuerligt är säkerhetspatchad och högtillgänglig. \n\nVi tillhandahåller helt enkelt skräddarsydda lösningar, byggda efter kundens behov på Linux och Red Hat produkter."
    },
    {
      "company": "Arbetsförmedlingen",
      "position": "OpenShift Specialist / DevOps Engineer",
      "website": "https://www.arbetsformedlingen.se",
      "startDate": "2020-08-01",
      "endDate": "2021-12-19",
      "keywords": [
        "openshift",
        "kubernetes",
        "cloud",
        "argocd",
        "containers",
        "devops",
        "infrastructure as code"
      ],
      "summary": "På arbetsförmedlingen har mina huvudsakliga arbetsuppgifter bestått i att designa, konfigurera samt installera deras nya molnmiljö baserad på OpenShift 4.6. Underliggande storage är byggd på Ceph och nätverksintegrationen är gjord med hjälp av Cisco's ACI-CNI plugin. Jag har lagt mycket fokus på självadministration där Oauth2 används för autentisering samt Servicenow för projekthantering. Klustret är installerat på Cisco UCS hårdvara som i sin tur är spridd över flera datacenter för att uppnå högtillgänglighet.",
      "summary_continue": "Jag har även hjälpt olika utvecklingsteam att containerisera deras applikationer, detta i form av Java (Spring Boot / Jboss EAP), Angular, Python, NodeJS, etc. Utöver det har jag även tagit fram pipelines i Jenkins (Groovy) åt olika team för att underlätta processen vid driftsättning av ny kod. \n\n Jag har också arbetat med att installera olika produkter för att demonstrera fördelarna med en molnmiljö, exempel på applikationer är PostgreSQL, MongoDB, Jira, Mattermost, Rocketchat, Element Matrix, Pastebins, osv."
    },
    {
      "company": "TriOptima",
      "position": "Linux Systemadministratör",
      "website": "https://www.trioptima.com",
      "startDate": "2016-04-01",
      "endDate": "2019-11-22",
      "keywords": [
        "openstack",
        "ceph",
        "red hat director",
        "ansible",
        "cloud",
        "terraform",
        "kerberos"
      ],
      "summary": "Mina huvudsakliga uppgifter på TriOptima har varit att installera, konfigurera, samt drifta deras moln och lagringsplattofrm byggd på OpenStack och Ceph. Installationen sträcker sig över tre datacenter och består av Red Hat OpenStack 13 samt Red Hat Ceph Storage. Designen inkluderar allt ifrån olika tillgänglighets zoner, lagringspooler (både lokala per datacenter, men även sträckta över flera datacenter), och inkluderar som helhet ca 50 noder. Installationen av OpenStack är gjort mha. egenbyggda templates och Red Hat Director, medan Ceph är installerad mha. Ceph Ansible Playbook. Vi har valt den här konfigurationen för att kunna erbjuda en skalbar helhetslösning som motsvarar våra interna kunders behov och krav. \n\nUnder resans gång upptäcktes en hel del buggar i olika komponenter (neutron, octavia, heat-templates, networkmanager), dessa har rapporterats upstream, men jag har även varit tvungen att patcha en hel del saker lokalt. \n\nUtöver det tog jag även fram en intern serviceportal där användare själva kan hantera access till sina OpenStack projekt. Autentisering till portalen samt OpenStack sker via Kerberos (Active Directory) och supporterar SSO."
    },
    {
      "company": "SMHI",
      "position": "Linux Systemadministratör",
      "website": "https://www.smhi.se",
      "startDate": "2008-05-16",
      "endDate": "2016-01-22",
      "keywords": [
        "puppet",
        "foreman",
        "cisco ucs",
        "itrs op5 monitor",
        "automation",
        "vmware",
        "infoblox",
        "nfs"
      ],
      "summary": "Mitt dagliga arbete på SMHI har mestadels bestått i att installera, konfigurera samt drifta ~ 1000 Red Hat Enterprise Linux servrar, samt 150 Red Had Enterprise Linux klienter. Infrastrukturen är i huvudsak uppsatt mha. Puppet, Ansible samt diverse automations-skript. Jag har under åren skrivit en hel del skript och automatiserat mot många olika delar av infrastrukturen, detta inkluderar bla. Cisco UCS, VMware, Infoblox, HP iLO, Foreman, Puppet, ITRS OP5 Monitor, Cacti, CA technologies, etc, och har gjorts mha. språk som Bash, Perl och Python. \n\nJag har varit en nyckelspelare i SMHI's satsning för en standardiserad Linux infrastruktur, både för servrar samt klienter. Målet har varit, att med automation samt en centraliserad managering, integrera alla Linux servrar samt klienter i befintlig SMHI infrastruktur, detta inkluderar",
      "highlights": [
        {
          "indentclass": "",
          "detail": "Autentisering (Active Directory, Kerberos, Smart kort, PKCS11, Cisco Anyconnect)"
        },
        {
          "indentclass": "",
          "detail": "Filservrar (NFSv3, NFSv4 + Kerberos, automount)"
        },
        {
          "indentclass": "",
          "detail": "Trådlös anslutning via 802.1x (Certifikat's utrullning via SCEP)"
        },
        {
          "indentclass": "",
          "detail": "Helt automatiserade installationer och konfigureringar för både servrar samt klienter (allt utifrån en gör-det-själv-service-portal)"
        }
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "SIDA",
      "position": "Linux Systemadministratör",
      "startDate": "2013-10-13",
      "endDate": "2013-11-01",
      "summary": "I samarbete med SIDA organisationen har jag vid två tillfällen besökt “Department of Meteorological Services” i Botswana. Mitt arbete här har huvudsak bestått av att bistå befintlig personal med installation av Linux servrar. Jag har även installerat och satt upp ett ärendehanterings-system (“Request Tracker”), samt en wiki och lite monitoreringssystem. Största utmaningarna vid dessa uppdrag har var bristen på infrastruktur samt avsaknaden av internet.",
      "keywords": [
        "request tracker",
        "mediawiki",
        "virtualization"
      ]
    }
  ],
  "education": [
    {
      "institution": "Umeå University, Linné universitet",
      "area": "Separata kurser",
      "startDate": "2009-01-01",
      "endDate": "2010-01-01",
      "courses": [
        {
          "name": "Linux as a developing platform",
          "keywords": [
            "c",
            "gcc",
            "make",
            "shell"
          ]
        },
        {
          "name": "Structured Programming with C++",
          "keywords": [
            "object oriented c++",
            "classes",
            "boost"
          ]
        }
      ]
    },
    {
      "institution": "Jensen Education",
      "area": "Linux Systemadministration",
      "startDate": "2007-01-01",
      "endDate": "2009-01-01",
      "courses": [
        {
          "name": "Nätverk och datorkommunikation",
          "keywords": [
            "inetd",
            "xinetd",
            "postfix",
            "bind",
            "apache",
            "nfs",
            "ldap"
          ]
        },
        {
          "name": "Operativsystemet Linux",
          "keywords": [
            "gnu tools",
            "file system",
            "file permissions",
            "pipes",
            "regular expressions"
          ]
        },
        {
          "name": "Programmering i Linux",
          "keywords": [
            "Compiling",
            "shell scripting",
            "perl",
            "python",
            "bash",
            "monitoring"
          ]
        },
        {
          "name": "Systemadministration Linux",
          "keywords": [
            "user management",
            "logging",
            "backup",
            "kernel modules",
            "virtualization",
            "storage solution"
          ]
        }
      ]
    }
  ]
}
